[tasks]
prove
cover

[options]
prove: mode bmc
prove: depth 15
cover: mode cover
cover: depth 15

[engines]
prove: smtbmc z3
cover: smtbmc z3

[script]
read_verilog -formal axi_monitor_timeout_flat.v
read -formal -sv formal_axi_monitor_timeout.sv
hierarchy -top formal_axi_monitor_timeout
proc
flatten
opt_expr
opt_clean
memory_map
async2sync
opt -full
setundef -undriven -init -expose

[files]
formal_axi_monitor_timeout.sv
axi_monitor_timeout_flat.v
