[tasks]
prove
cover

[options]
prove: mode bmc
prove: depth 12
cover: mode cover
cover: depth 18

[engines]
prove: smtbmc z3
cover: smtbmc z3

[script]
read_verilog -formal axi_monitor_addr_check_flat.v
read -formal -sv formal_axi_monitor_addr_check.sv
hierarchy -top formal_axi_monitor_addr_check
proc
flatten
opt_expr
opt_clean
memory_map
async2sync
opt -full
setundef -undriven -init -zero

[files]
formal_axi_monitor_addr_check.sv
axi_monitor_addr_check_flat.v
