[tasks]
prove
cover

[options]
prove: mode bmc
prove: depth 20
cover: mode cover
cover: depth 30

[engines]
prove: smtbmc z3
cover: smtbmc z3

[script]
read_verilog -formal apb5_monitor_flat.v
read -formal -sv formal_apb5_monitor.sv
hierarchy -top formal_apb5_monitor
proc
flatten
opt_expr
opt_clean
memory_map
async2sync
opt -full
setundef -undriven -init -expose

[files]
formal_apb5_monitor.sv
apb5_monitor_flat.v
